In [5]:

import os

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [6]:
p = os.path.abspath('C:/4-1/names/yob2010.txt')

In [7]:
x = pd.read_csv(p, 
            names=['Name', 'Gender', 'Count'])

In [8]:
x.sort_values(by='Count')
x[:3]

       Name Gender  Count
0  Isabella      F  22898
1    Sophia      F  20634
2      Emma      F  17333

In [21]:
def count_top_3(year):
    p = os.path.abspath('C:/4-1/names/yob' + str(year) + '.txt')
    x = pd.read_csv(p, 
            names=['Name', 'Gender', 'Count'])
    top = (x.sort_values(by='Count'))[-3::]
    top_3 = top.sort_values(by='Count')
    print(top_3)
    return top_3

In [22]:
count_top_3(2004)

          Name Gender  Count
0        Emily      F  25032
18826  Michael      M  25448
18825    Jacob      M  27876

          Name Gender  Count
0        Emily      F  25032
18826  Michael      M  25448
18825    Jacob      M  27876